# Напишите функцию-декоратор, оборачивающую результат другой функции в прямоугольник звездочек.
# Пояснение: если декорируемая функция возвращает “Привет”, то декоратор должен изменить вывод на:
# ********
# *Привет*
# ********
# ****
# *23*
# ****
# (кол-во звездочек зависит от длины возвращаемого значения)

def stars(func):
    def wrapper():
        res = func()
        n = len(res) + 4
        print("*" * n)
        print('*', res, '*')
        print("*" * n)
    return wrapper

@stars
def my_function():
    return "Hello"

my_function()
