## "Бесконечный ввод и подсчет положительных"

### Задание

С клавиатуры вводятся целые числа, до тех пор пока не будет введена строка "стоп". \
Посчитайте количество положительных чисел, среди введенных.

### Формат входных данных

Вводятся целые числа, пока не будет введено "стоп".

### Формат выходных данных

Вывести количество положительных.

### Решение задачи

```python
# TODO: you code here...
count = 0
while True:
    n = input('n = ')
    if n == 'stop':
        break
    if int(n) > 0:
        count += 1
print(count, 'positive numbers')
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотри пример "Выполнение цикла пока не будет введено нужное значение"
</details>
