# Дано произвольное предложение. Слова разделены пробелами. Предложение содержит знаки препинания.
# Найдите:
# 1) первое слово из строки
# 2) первые два символа каждого слова
# 3) все слова начинающиеся на гласную букву
# 4) все слова начинающиеся на согласную букву
# 5) все уникальные(без дубликатов) знаки препинания

import re

text = "Дано произвольное предложение. Слова разделены пробелами, предложение содержит и знаки препинания."

pattern = r'^\w+'
found = re.findall(pattern, text)
print(found)
pattern = r'\w\w*[^\W]?'
found = re.findall(pattern, text)
print(found)
pattern = r"\W(?!\S)"
found = re.findall(pattern, text)
print(found)
